{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"dropout": 0.0, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "unit_forget_bias": true, "name": "lstm_1", "dtype": "float32", "return_sequences": false, "batch_input_shape": [1, 1, 1], "stateful": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "recurrent_regularizer": null, "recurrent_constraint": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "bias_constraint": null, "recurrent_dropout": 0.0, "activation": "tanh", "go_backwards": false, "kernel_regularizer": null, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 4}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "name": "dense_1", "bias_constraint": null, "trainable": true, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "units": 1}}], "keras_version": "2.1.2"}